In [1]:
import pandas as pd

## Load Dataset

In [5]:
train = pd.read_csv("train.csv", index_col = "PassengerId")

print(train.shape)
train.head()

(891, 11)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
#Todo
#Load test.csv dataset!

In [9]:
test = pd.read_csv("test.csv", index_col = "PassengerId")

print(test.shape)
test.head()

(418, 10)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Preprocessing (전처리)

### Encode Sex

In [14]:
train["Sex_encode"] = train["Sex"].replace("male", 0).replace("female", 1)

print(train.shape)
#train[["Name", "Sex", "Sex_encode"]].head()

(891, 12)

In [15]:
test["Sex_encode"] = test["Sex"].replace("male", 0).replace("female", 1)

print(test.shape)
#test[["Name", "Sex", "Sex_encode"]].head()

(418, 11)

### Fill in missing Fare

In [19]:
train[train["Fare"].isnull()]

# train date는 운임요금이 비어(null)있는 값이 없어서 변경 필요없음

Empty DataFrame
Columns: [Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Sex_encode]
Index: []

In [20]:
test["Fare"] = test["Fare"].fillna(0)
test[test["Fare"].isnull()]

# test data는 운임요금에 공란이 생겨 Disision tree를 적용하면 오류가 생겨 해당값을 fillna로 채워 줌
# 데이터가 많거나 정확도를 높이고 싶을 경우 평균값으로 넣어줘도 되지만 지금은 1건이라 0원(무임승차)로 채워 줌

Empty DataFrame
Columns: [Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Sex_encode]
Index: []

In [22]:
train["Child"] = train["Age"] < 10

print(train.shape)
train[["Name", "Age", "Child"]].head()

(891, 13)

                                                          Name   Age  Child
PassengerId
1                                      Braund, Mr. Owen Harris  22.0  False
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  False
3                                       Heikkinen, Miss. Laina  26.0  False
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  False
5                                     Allen, Mr. William Henry  35.0  False

In [25]:
test["Child"] = test["Age"] < 10

print(test.shape)
test[["Name", "Age", "Child"]].head()

(418, 12)

                                                     Name   Age  Child
PassengerId
892                                      Kelly, Mr. James  34.5  False
893                      Wilkes, Mrs. James (Ellen Needs)  47.0  False
894                             Myles, Mr. Thomas Francis  62.0  False
895                                      Wirz, Mr. Albert  27.0  False
896          Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0  False

### Train

In [26]:
#Feature(x) -  Pclass, Sex_encode, Fare, Child 
#label(y) - Survived

In [37]:
feature_names = ["Pclass", "Sex_encode", "Fare", "Child"]
feature_names

['Pclass', 'Sex_encode', 'Fare', 'Child']

In [45]:
x_train = train[feature_names]

print(x_train.shape)
#x_train.head()

(891, 4)

In [46]:
x_test = test[feature_names]

print(x_test.shape)
#x_test.head()

(418, 4)

In [48]:
label_names = ["Survived"]

y_train = train[label_names]

print(y_train.shape)
y_train.head()

(891, 1)

             Survived
PassengerId
1                   0
2                   1
3                   1
4                   1
5                   0

### Use Decision Tree (의사결정나무)

In [69]:
#scikit-learn == sklearn
# import sklearn

from sklearn.tree import DecisionTreeClassifier

model = DecisionTreeClassifier(max_depth = 5)
model

DecisionTreeClassifier(max_depth=5)

In [70]:
# 1) fit(train) -> 2) predict(test)
# fit = 의사결정 알고리즘이 스스로 학습하는것

model.fit(x_train, y_train)

DecisionTreeClassifier(max_depth=5)

In [71]:
prediction = model.predict(x_test)

print(prediction.shape)
prediction

(418,)

array([0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1,
       0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

### Submit

In [72]:
submit = pd.read_csv("gender_submission.csv", index_col = "PassengerId")
submit["Survived"] = prediction

print(summit.shape)
submit.head()

(418, 1)

             Survived
PassengerId
892                 0
893                 1
894                 0
895                 0
896                 0

In [75]:
submit.to_csv("decision-tree.csv")